[
  {
    "id": "1",
    "movie-name": "Hocus Pocus",
    "movie-plot": "After 300 years of slumber, three sister witches are accidentally resurrected in Salem on Halloween night, and it is up to three kids and their newfound feline friend to put an end to the witches' reign of terror once and for all.",
    "movie-poster": "https://image.tmdb.org/t/p/original/by4D4Q9NlUjFSEUA1yrxq6ksXmk.jpg"
  },

  {
    "id": "2",
    "movie-name": "Corpse Bride",
    "movie-plot": "In a 19th-century European village, a young man about to be married is whisked away to the underworld and wed to a mysterious corpse bride, while his real bride waits bereft in the land of the living.",
    "movie-poster": "https://image.tmdb.org/t/p/original/m6BMveplVmnBygLNihX4rcW7IR4.jpg"
  },

  {
    "id": "3",
    "movie-name": "Monsters, Inc.",
    "movie-plot": "Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. When a little girl named Boo wanders into their world, it's the monsters who are scared silly, and it's up to Sulley and Mike to keep her out of sight and get her back home.",
    "movie-poster": "https://image.tmdb.org/t/p/original/sgheSKxZkttIe8ONsf2sWXPgip3.jpg"
  },

  {
    "id": "4",
    "movie-name": "Coraline",
    "movie-plot": "Wandering her rambling old house in her boring new town, 11-year-old Coraline discovers a hidden door to a strangely idealized version of her life. In order to stay in the fantasy, she must make a frighteningly real sacrifice.",
    "movie-poster": "https://image.tmdb.org/t/p/original/nUiumSEJAHtlmtOptoHEbhWJXk9.jpg"
  },

  {
    "id": "5",
    "movie-name": "Ghostbusters",
    "movie-plot": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting 'ghostbusters' who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
    "movie-poster": "https://image.tmdb.org/t/p/original/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg"
  },

  {
    "id": "6",
    "movie-name": "Saw",
    "movie-plot": "Two men wake up to find themselves shackled in a grimy, abandoned bathroom. As they struggle to comprehend their predicament, they discover a disturbing tape left behind by the sadistic mastermind known as Jigsaw. With a chilling voice and cryptic instructions, Jigsaw informs them that they must partake in a gruesome game in order to secure their freedom.",
    "movie-poster": "https://image.tmdb.org/t/p/original/harQifr8kpIVqlLP41kTR058LZB.jpg"
  },

  {
    "id": "7",
    "movie-name": "Child's Play",
    "movie-plot": "An innocent-looking doll is inhabited by the soul of a serial killer who refuses to die.",
    "movie-poster": "https://image.tmdb.org/t/p/original/tiGJO2QHEqZcq5cPNGmqViswzpy.jpg"
  },

  {
    "id": "8",
    "movie-name": "Texas Chainsaw Massacre",
    "movie-plot": "After picking up a traumatized young hitchhiker, five friends find themselves stalked and hunted by a chainsaw-wielding killer and his family of equally psychopathic killers.",
    "movie-poster": "https://image.tmdb.org/t/p/original/qJ9Cw1J4EmhBApoue4qlhqVrCZ7.jpg"
  },

  {
    "id": "9",
    "movie-name": "The Blair Witch Project",
    "movie-plot": "In October of 1994 three student filmmakers disappeared in the woods near Burkittsville, Maryland, while shooting a documentary. A year later their footage was found.",
    "movie-poster": "https://image.tmdb.org/t/p/original/tBV4INmItU7nRQtDNHRmgFcb7RC.jpg"
  },

  {
    "id": "10",
    "movie-name": "The Shining",
    "movie-plot": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
    "movie-poster": "https://image.tmdb.org/t/p/original/xazWoLealQwEgqZ89MLZklLZD3k.jpg"
  },
  { "id" : "11",
"movie-name" : "Terrifier",
"movie}
]
Terrifier 
IT 
Sinister 
The Orphan 
Night of the Living Dead 